In [1]:
import pandas as pd

In [ ]:
import pandas as pd
dados =pd.read_csv(r"/home/youx/Dados/venda-de-carros.csv")
dados

In [ ]:

import pandas as pd
dados =pd.read_csv(r"/home/youx/Dados/venda-de-carros.csv")
dados.head()#mostra as 5 primeiras linhas

In [20]:
import pandas as pd
dados =pd.read_csv(r"/home/youx/Dados/venda-de-carros.csv")
dados.info()#informa as informações da base

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [ ]:
import pandas as pd
dados =pd.read_csv(r"/home/youx/Dados/venda-de-carros.csv")
type(dados)
dados.shape#retorna quantas linhas e colunas tem no DataFrame:

In [13]:
personagens_df = pd.DataFrame ({
    'nome':['Luke Skywalker', 'Yoda' , 'Palpitine'],
    'idade':['16' , '1000' , '70'],
    'peso' :[70.5, 15.2 , 60.1],
    'eh jedi':[True,True,True]

})
personagens_df

             nome idade  peso  eh jedi
0  Luke Skywalker    16  70.5     True
1            Yoda  1000  15.2     True
2       Palpitine    70  60.1     True

In [14]:
personagens_df.columns#.columns retorna uma “lista” com nome de todas as colunas, também é possível armazenar em uma lista
lista_personagens = list(personagens_df.columns)
lista_personagens

['nome', 'idade', 'peso', 'eh jedi']

In [15]:
personagens_df_renomeado = personagens_df.rename(columns={
    'nome' : 'Nome Completo' , #Renomeia essa coluna
    'idade' : 'Idade'
})

personagens_df_renomeado

    Nome Completo Idade  peso  eh jedi
0  Luke Skywalker    16  70.5     True
1            Yoda  1000  15.2     True
2       Palpitine    70  60.1     True

In [ ]:
personagens_df.rename(columns={
    'nome' : 'Nome Completo' , #Renomeia essa coluna com inplsce=True
    'idade' : 'Idade'},
    inplace=True)

personagens_df

In [16]:
personagens_df.columns = ['NOME' , 'IDADE' , 'PESO' , 'EH JEDI']
personagens_df

             NOME IDADE  PESO  EH JEDI
0  Luke Skywalker    16  70.5     True
1            Yoda  1000  15.2     True
2       Palpitine    70  60.1     True

In [ ]:
series1= pd.Series([5.5 , 6.0 , 9.5])
series1#O método .Series() cria uma series, basta passar uma lista

In [ ]:
series1= pd.Series([5.5, 6.0, 9.5], index=['prova1', 'prova2', 'projeto'], name = "Notas Do Yoda")
series1#modificar com index

prova1     5.5
prova2     6.0
projeto    9.5
Name: Notas Do Yoda, dtype: float64

In [ ]:
cor_copia= dados['Cor'].copy
cor_copia#copia

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

In [ ]:
series1 = pd.Series([5.5, 6.0, 9.5], index=['prova1', 'prova2', 'projeto'], name = "Notas Do Yoda")

series2 = pd.Series([5.5, 6.0, 9.5], index=['prova1', 'prova2', 'projeto'], name = "Notas Do Mandalorian")

dados_series = pd.concat([series1 , series2], axis=1)
dados_series

#Para gerar DataFrame a partir de series, podemos usar o .concat():

         Notas Do Yoda  Notas Do Mandalorian
prova1             5.5                   5.5
prova2             6.0                   6.0
projeto            9.5                   9.5

In [ ]:
dados['Nova Coluna'] = 'Elden Ring'
dados#Cria uma nova coluna

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

In [ ]:
dados['Quilometragem2'] = dados['Quilometragem'] * 2
dados
#criar também utilizando outra coluna, como por exemplo, criar uma coluna multiplicandoa Quilometragem por 2:

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem2
0,Toyota,Branco,150043,4,"R$ 24,000.00",Elden Ring,300086
1,Honda,Vermelho,87899,4,"R$ 25,000.00",Elden Ring,175798
2,Toyota,Azul,32549,3,"R$ 27,000.00",Elden Ring,65098
3,BMW,Preto,11179,5,"R$ 122,000.00",Elden Ring,22358
4,Nissan,Branco,213095,4,"R$ 13,500.00",Elden Ring,426190
5,Toyota,Verde,99213,4,"R$ 14,500.00",Elden Ring,198426
6,Honda,Azul,45698,4,"R$ 17,500.00",Elden Ring,91396
7,Honda,Azul,54738,4,"R$ 27,000.00",Elden Ring,109476
8,Toyota,Branco,60000,4,"R$ 26,250.00",Elden Ring,120000
9,Nissan,Branco,31600,4,"R$ 19,700.00",Elden Ring,63200

In [ ]:
print(dados)

dados.iloc[1]
#O .iloc[] retorna todas as observações indexadas na posição (posição começa do 0) que escolher

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

   Quilometragem2
0          300086
1          175798
2           65098
3           22358
4          426190
5          198426
6           91396
7          109476
8          120000
9           63200

Fabricante               Honda
Cor                   Vermelho
Quilometragem            87899
Portas                       4
Preco             R$ 25,000.00
Nova Coluna         Elden Ring
Quilometragem2          175798
Name: 1, dtype: object

In [ ]:
print(dados)

dados.iloc[4:3]#Pode pegar por colunas tambem

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

   Quilometragem2
0          300086
1          175798
2           65098
3           22358
4          426190
5          198426
6           91396
7          109476
8          120000
9           63200

Empty DataFrame
Columns: [Fabricante, Cor, Quilometragem, Portas, Preco, Nova Coluna, Quilometragem2]
Index: []

In [ ]:
print(dados)
#O .loc[] faz o index acessa os rótulos dos index, se eu acessar o rótulo 4 do index:
dados.loc[1]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

   Quilometragem2
0          300086
1          175798
2           65098
3           22358
4          426190
5          198426
6           91396
7          109476
8          120000
9           63200

Fabricante               Honda
Cor                   Vermelho
Quilometragem            87899
Portas                       4
Preco             R$ 25,000.00
Nova Coluna         Elden Ring
Quilometragem2          175798
Name: 1, dtype: object

In [37]:
print(dados)

dados.loc[4:3, 'Quilometragem']

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

   Quilometragem2
0          300086
1          175798
2           65098
3           22358
4          426190
5          198426
6           91396
7          109476
8          120000
9           63200

Series([], Name: Quilometragem, dtype: int64)

In [ ]:
dados[['Fabricante','Cor','Portas']]#Seleção de múltiplas colunas:

  Fabricante       Cor  Portas
0     Toyota    Branco       4
1      Honda  Vermelho       4
2     Toyota      Azul       3
3        BMW     Preto       5
4     Nissan    Branco       4
5     Toyota     Verde       4
6      Honda      Azul       4
7      Honda      Azul       4
8     Toyota    Branco       4
9     Nissan    Branco       4

In [41]:
del dados['Quilometragem2']
dados

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

In [ ]:
dados['Fabricante'].unique()#O .unique() retorna os dados únicos de uma coluna:

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [ ]:
dados_filtrados = dados.query('Fabricante == "Honda"').reset_index()
dados_filtrados#Para filtrar por condições, utilizamos .query() e no final do filtro usamos .reset_index() para osdados filtrados voltarem o index começando do 0

   index Fabricante       Cor  Quilometragem  Portas         Preco Nova Coluna
0      1      Honda  Vermelho          87899       4  R$ 25,000.00  Elden Ring
1      6      Honda      Azul          45698       4  R$ 17,500.00  Elden Ring
2      7      Honda      Azul          54738       4  R$ 27,000.00  Elden Ring

In [46]:
dados_filtrados2 = dados.query('Fabricante == "Honda" and Cor == "Azul"').reset_index()
dados_filtrados2

   index Fabricante   Cor  Quilometragem  Portas         Preco Nova Coluna
0      6      Honda  Azul          45698       4  R$ 17,500.00  Elden Ring
1      7      Honda  Azul          54738       4  R$ 27,000.00  Elden Ring

In [ ]:
lista_cor = ['Azul', 'Vermelho']
dados_filtrados5 =dados.query('Cor in @lista_cor')
dados_filtrados5#Filtrando a partir de uma lista:

  Fabricante       Cor  Quilometragem  Portas         Preco Nova Coluna
1      Honda  Vermelho          87899       4  R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3  R$ 27,000.00  Elden Ring
6      Honda      Azul          45698       4  R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4  R$ 27,000.00  Elden Ring

In [ ]:
dados['Quilometragem'].describe()
#O .describle() nos retorna a estatística descritiva como contagem, média, etc.:

count        10.000000
mean      78601.400000
std       61983.471735
min       11179.000000
25%       35836.250000
50%       57369.000000
75%       96384.500000
max      213095.000000
Name: Quilometragem, dtype: float64

In [ ]:
print(dados['Quilometragem'].mean)
print(dados['Quilometragem'].sum)
print(dados['Quilometragem'].std)
print(dados['Quilometragem'].min)
print(dados['Quilometragem'].max)
#Para calcular a média, soma, desvio padrão, min, max:

<bound method Series.mean of 0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64>
<bound method Series.sum of 0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64>
<bound method Series.std of 0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64>
<bound method Series.min of 0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64>
<bound method Series.max of 0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64>

In [ ]:
dados['Fabricante'].value_counts()#contagem

Fabricante
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

In [ ]:
dados_fabricantes = dados['Fabricante'].value_counts().to_frame().reset_index()
dados_fabricantes
#Podemos também criar um novo DataFrame usando .to_frame():

  Fabricante  count
0     Toyota      4
1      Honda      3
2     Nissan      2
3        BMW      1

In [57]:
grupos = dados.groupby('Nova Coluna')
grupos.groups

{'Elden Ring': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]}

In [59]:
grupos.get_group('Elden Ring')

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring

In [60]:
grupos.describe()

            Quilometragem                                                     \
                    count     mean           std      min       25%      50%
Nova Coluna
Elden Ring           10.0  78601.4  61983.471735  11179.0  35836.25  57369.0

                               Portas
                 75%       max  count mean       std  min  25%  50%  75%  max
Nova Coluna
Elden Ring   96384.5  213095.0   10.0  4.0  0.471405  3.0  4.0  4.0  4.0  5.0

In [63]:
grupos2 =dados.groupby(['Cor','Preco'])
grupos2

In [66]:
grupos2.groups

{('Azul', 'R$ 17,500.00'): [6], ('Azul', 'R$ 27,000.00'): [2, 7], ('Branco', 'R$ 13,500.00'): [4], ('Branco', 'R$ 19,700.00'): [9], ('Branco', 'R$ 24,000.00'): [0], ('Branco', 'R$ 26,250.00'): [8], ('Preto', 'R$ 122,000.00'): [3], ('Verde', 'R$ 14,500.00'): [5], ('Vermelho', 'R$ 25,000.00'): [1]}

In [84]:
df = pd.DataFrame([[1,2,3],[5,23,13],[6,5,9],
[None , None , None]],
columns=['A' , 'B' , 'C'])


df

     A     B     C
0  1.0   2.0   3.0
1  5.0  23.0  13.0
2  6.0   5.0   9.0
3  NaN   NaN   NaN

In [85]:
df.agg([sum, min])
df

/tmp/ipykernel_34008/1903481843.py:1: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.agg([sum, min])
/tmp/ipykernel_34008/1903481843.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg([sum, min])

     A     B     C
0  1.0   2.0   3.0
1  5.0  23.0  13.0
2  6.0   5.0   9.0
3  NaN   NaN   NaN

In [86]:
grupos['Preco'].agg([min,max])

/tmp/ipykernel_34008/3297875812.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  grupos['Preco'].agg([min,max])
/tmp/ipykernel_34008/3297875812.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grupos['Preco'].agg([min,max])

                       min           max
Nova Coluna
Elden Ring   R$ 122,000.00  R$ 27,000.00

In [87]:
notas=pd.DataFrame({
    'nome': ['joão', 'Maria', 'Gustavo' , 'Alice'],
    'idade': [12,14,17,22],
    'notas' : [5.0,6.0,10.0,3.0]

})
notas

      nome  idade  notas
0     joão     12    5.0
1    Maria     14    6.0
2  Gustavo     17   10.0
3    Alice     22    3.0

In [93]:
notas.sort_values(by='notas', ascending=False)

      nome  idade  notas
2  Gustavo     17   10.0
1    Maria     14    6.0
0     joão     12    5.0
3    Alice     22    3.0

In [97]:
notas.sort_values(by=['notas', 'nome'], ascending=[False, True])

      nome  idade  notas
2  Gustavo     17   10.0
1    Maria     14    6.0
0     joão     12    5.0
3    Alice     22    3.0

In [ ]:
notas.sort_values(by=['notas', 'nome'], ascending=[False, True], inplace=True)
#vai salvar a lista com as alterações

In [98]:
dados

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna
0     Toyota    Branco         150043       4   R$ 24,000.00  Elden Ring
1      Honda  Vermelho          87899       4   R$ 25,000.00  Elden Ring
2     Toyota      Azul          32549       3   R$ 27,000.00  Elden Ring
3        BMW     Preto          11179       5  R$ 122,000.00  Elden Ring
4     Nissan    Branco         213095       4   R$ 13,500.00  Elden Ring
5     Toyota     Verde          99213       4   R$ 14,500.00  Elden Ring
6      Honda      Azul          45698       4   R$ 17,500.00  Elden Ring
7      Honda      Azul          54738       4   R$ 27,000.00  Elden Ring
8     Toyota    Branco          60000       4   R$ 26,250.00  Elden Ring
9     Nissan    Branco          31600       4   R$ 19,700.00  Elden Ring